package Lab3;

public class Task {
    /*
Використовуйте колекції, графічний інтерфейс не потрібен.
Взаємодію з користувачем демонструвати не потрібно.

Створіть модель яка б відображала роботу інтернет-магазину- клієнт
має можливість зробити сформувати замовлення, яке складається тільки
з товарів, які є у магазині. При цьому він має можливість пошукати
товар за назвою та виробником, редагувати свої замовлення до моменту
їх формування та відгрузки. Якщо товару на складі не вистачає, клієнт
в момент додавання товару до замовлення  отримує відповідне повідомлення.
Продавець має можливість продивитись усі замовлення, сформувати їх з
товарів на складі та відправити замовникам. Модель повинна давати
можливість додавати товар на склад та формувати список товарів на
складі. Клієнт може продивитись всі свої замовлення та їх стан.
*/
}
